ag1357/AetherSparse/firmware/p4_media_bench/sdkconfig.defaults
# ESP32-P4 media characterization defaults (ESP-IDF v5.5.1), cloned from the
# verified p4_qualification defaults.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# FAT + SDMMC. FS_LOCK must be 0: all IO happens on the main task, and the
# FatFs file-lock pool otherwise caps concurrent opens (3rd open -> ENFILE).
CONFIG_FATFS_VOLUME_COUNT=2
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_FS_LOCK=0

CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
